docs/test-results/phase4/unit6-closed-formal/m1-n50-f1-rep3/k6-stdout.log
time="2026-08-29T01:33:08+09:00" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"maxDuration\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/user/Documents/GitHub/llm-concurrency-lab/load-test-k6/scenarios/04-phase4-closed-wave.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 50 iterations shared among 50 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

running (00m40.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00m00.6s/10m0s  00/50 shared iters

running (00m41.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00m01.6s/10m0s  00/50 shared iters

running (00m42.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00m02.6s/10m0s  00/50 shared iters

running (00m43.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00m03.6s/10m0s  00/50 shared iters

running (00m44.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00m04.6s/10m0s  00/50 shared iters

running (00m45.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00m05.6s/10m0s  00/50 shared iters

running (00m46.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00m06.6s/10m0s  00/50 shared iters

running (00m47.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 50 VUs  00m07.6s/10m0s  00/50 shared iters


  █ TOTAL RESULTS 

    CUSTOM
    client_actual_started_total................: 50     1.056306/s
    client_completed_stream_duration_seconds...: avg=7.92588       min=7.9           med=7.934         max=7.937         p(90)=7.9361        p(95)=7.937        
    client_completed_ttfc_seconds..............: avg=1.02802       min=1.011         med=1.032         max=1.038         p(90)=1.036         p(95)=1.03655      
    client_events_received_total...............: 1800   38.02702/s
    client_stream_completed_total..............: 50     1.056306/s
    client_stream_duration_seconds.............: avg=7.92588       min=7.9           med=7.934         max=7.937         p(90)=7.9361        p(95)=7.937        
    client_ttfc_seconds........................: avg=1.02802       min=1.011         med=1.032         max=1.038         p(90)=1.036         p(95)=1.03655      
    client_wave_start_epoch_ms.................: avg=496648h33m48s min=496648h33m48s med=496648h33m48s max=496648h33m48s p(90)=496648h33m48s p(95)=496648h33m48s
    sse_event..................................: 1980   41.829722/s

    HTTP
    http_req_duration..........................: avg=7.92s         min=7.87s         med=7.93s         max=7.93s         p(90)=7.93s         p(95)=7.93s        
    http_reqs..................................: 55     1.161937/s

    EXECUTION
    iteration_duration.........................: avg=7.92s         min=7.9s          med=7.93s         max=7.93s         p(90)=7.93s         p(95)=7.93s        
    iterations.................................: 50     1.056306/s
    vus........................................: 50     min=0       max=50
    vus_max....................................: 50     min=50      max=50

    NETWORK
    data_received..............................: 233 kB 4.9 kB/s
    data_sent..................................: 15 kB  313 B/s



running (00m47.3s), 00/50 VUs, 50 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  00m07.9s/10m0s  50/50 shared iters